Revit 2027 API
IndexLine.Index0 Property
 The index of the line segment's first vertex.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Index0 { get; set; }
Public Property Index0 As Integer
	Get
	Set
public:
property int Index0 {
	int get ();
	void set (int value);
}
member Index0 : int with get, set
Property Value
Int32
See Also
Reference
IndexLine Class
Autodesk.Revit.DB.DirectContext3D Namespace